<a href="https://colab.research.google.com/github/Nagasreenivasulu/pandasdataframe/blob/main/PandasDataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

**Creating data frame from multiple lists**

In [4]:
name = ['Naga','Sreenu','Vasu']
salary = [48000,60000,70000]
df = pd.DataFrame({'Name':name, 'Salary':salary})
df.head()

     Name  Salary
0    Naga   48000
1  Sreenu   60000
2    Vasu   70000

**Increasing Salary By 10% in new column using lambda function**

In [14]:
df['New_Salary'] = df['Salary'].apply(lambda X: (X+(X*10/100)))
df

     Name  Salary  New_Salary
0    Naga   48000     52800.0
1  Sreenu   60000     66000.0
2    Vasu   70000     77000.0

**Renaming the column**

In [18]:
df.rename(columns={'Salary':'Old_Salary'}, inplace=True)

In [19]:
df

     Name  Old_Salary  New_Salary
0    Naga       48000     52800.0
1  Sreenu       60000     66000.0
2    Vasu       70000     77000.0

**Increasing Salary By 10% in new column using def function**

In [21]:
def increseby10(val):
  val += val*10/100
  return val
df['New_Salary_def_fun'] = df['Old_Salary'].apply(increseby10)
df

     Name  Old_Salary  New_Salary  New_Salary_def_fun
0    Naga       48000     52800.0             52800.0
1  Sreenu       60000     66000.0             66000.0
2    Vasu       70000     77000.0             77000.0

**Removing column from dataframe**

In [23]:
del df['New_Salary_def_fun']
df

     Name  Old_Salary  New_Salary
0    Naga       48000     52800.0
1  Sreenu       60000     66000.0
2    Vasu       70000     77000.0

**Shallow copy of dataframe**

In [24]:
df2 = df
df2

     Name  Old_Salary  New_Salary
0    Naga       48000     52800.0
1  Sreenu       60000     66000.0
2    Vasu       70000     77000.0

**Adding new column named experiance in data frame 2**

In [25]:
experiance = [3, 4, 5]
df2['Experiance'] = pd.DataFrame({'Experiance':experiance})
df2

     Name  Old_Salary  New_Salary  Experiance
0    Naga       48000     52800.0           3
1  Sreenu       60000     66000.0           4
2    Vasu       70000     77000.0           5

**Checking df**

In [26]:
df

     Name  Old_Salary  New_Salary  Experiance
0    Naga       48000     52800.0           3
1  Sreenu       60000     66000.0           4
2    Vasu       70000     77000.0           5

If we change i df2 then it will reflect in df

**Deep Copy**

In [27]:
df3 = df.copy(deep=True)

In [28]:
df3

     Name  Old_Salary  New_Salary  Experiance
0    Naga       48000     52800.0           3
1  Sreenu       60000     66000.0           4
2    Vasu       70000     77000.0           5

**Adding new column to df3**

In [29]:
company = ['C1','C2','C3']
df3['Company'] = pd.DataFrame({'Company':company})
df3

     Name  Old_Salary  New_Salary  Experiance Company
0    Naga       48000     52800.0           3      C1
1  Sreenu       60000     66000.0           4      C2
2    Vasu       70000     77000.0           5      C3

**Checking df**

In [30]:
df

     Name  Old_Salary  New_Salary  Experiance
0    Naga       48000     52800.0           3
1  Sreenu       60000     66000.0           4
2    Vasu       70000     77000.0           5

No changes in df because df3 is deep copy of df

**bold text**

**Sentence to words, and length dataframe**

In [8]:
#Sentence
text = 'My name is naga sreenivasulu. I am a Data Scientist. I have experiance in Python, and Machine learning models implementation.'
words = []
word_length = []
word_tokenization= text.split();
for i in word_tokenization:
  words.append(i)
  word_length.append(len(i))
df_word_length = pd.DataFrame({'Word':words, 'Length':word_length})
df_word_length

               Word  Length
0                My       2
1              name       4
2                is       2
3              naga       4
4     sreenivasulu.      13
5                 I       1
6                am       2
7                 a       1
8              Data       4
9        Scientist.      10
10                I       1
11             have       4
12       experiance      10
13               in       2
14          Python,       7
15              and       3
16          Machine       7
17         learning       8
18           models       6
19  implementation.      15